Обработки/DataProcessors/_ЭкспортДанныхДляРисков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ЭкспортДанныхДляРисков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активы</Name>
					<Comment>Dbo.Assets1C8</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделкиРепо</Name>
					<Comment>Dbo.Repo1C8</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочникСчетов</Name>
					<Comment>Dbo.Clients1C8</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозиты</Name>
					<Comment>Dbo.Deposits1C8</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Котировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_ЭкспортДанныхДляРисков/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыгрузитьДанныеНаСервере()
	
	ЭтаФорма.ОтчетРасхожденияЦен = "";
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Если ЭтаФорма.ВыгрузитьДатыПервыхПартий Тогда
		ОбъектНаСервере.ДополнительныеСвойства.Вставить("ЗаполнитьДатыПервыхПартий", Истина);
	КонецЕсли;
	
	Если ЭтаФорма.СформироватьОтчет Тогда
		ОбъектНаСервере.ДополнительныеСвойства.Вставить("ПроверитьНаличиеЦенОценки", Истина);
	КонецЕсли;
		
	ЭтаФорма.ОтчетРасхожденияЦен = ОбъектНаСервере.Выгрузить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		ЭтаФорма.Элементы.ГруппаКотировки.Видимость       = Ложь;
		ЭтаФорма.Элементы.ГруппаНастройкиАссетс.Видимость = Ложь;
	Иначе
		ЭтаФорма.Элементы.ГруппаНастройкиАссетс.Видимость = Объект.Активы;	
	КонецЕсли;
	
	ЭтаФорма.Элементы.ОтборПоБумаге.Видимость = Ложь;
	ЭтаФорма.Элементы.ЦеннаяБумага.Видимость  = Ложь;
	ЭтаФорма.Элементы.ГруппаОтчетРасхожденияЦен.Видимость = ЭтаФорма.СформироватьОтчет;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	Если Не (Объект.СделкиРепо ИЛИ Объект.СправочникСчетов ИЛИ Объект.Активы 
					ИЛИ Объект.Депозиты ИЛИ Объект.Котировки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать таблицу в БД Repository для выгрузки данных");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.ОтборПоБумаге И Не ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать ценную бумагу",,,"Объект.ЦеннаяБумага");
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Объект.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Объект.Период");
		Возврат;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	Если Объект.Период.ДатаНачала > ТекДата Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала периода не должна быть больше текущей даты [" + Формат(ТекДата, "ДФ=dd.MM.yyyy") + "]",,, "Объект.Период");
		Возврат;	
	КонецЕсли;
		
	Если Объект.Период.ДатаОкончания > КонецДня(ТекДата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания периода не должна быть больше текущей даты [" + Формат(ТекДата, "ДФ=dd.MM.yyyy") + "]",,, "Объект.Период");
		Возврат;
	КонецЕсли;
		
	ВыгрузитьДанныеНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВсеПриИзменении(Элемент)
	
	Объект.Активы     = ЭтаФорма.ВыгрузитьВсе;
	Объект.СправочникСчетов = ЭтаФорма.ВыгрузитьВсе;
	Объект.Депозиты   = ЭтаФорма.ВыгрузитьВсе;
	Объект.СделкиРепо = ЭтаФорма.ВыгрузитьВсе;
	Объект.Котировки  = ЭтаФорма.ВыгрузитьВсе;

	КотировкиПриИзменении(Элемент);
	ВыгрузитьАктивыПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КотировкиПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.ОтборПоБумаге.Видимость = Объект.Котировки;
	Если Не Объект.Котировки  Тогда
		ЭтаФорма.ОтборПоБумаге = Ложь;
	КонецЕсли;
	ОтборПоБумагеПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоБумагеПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.ЦеннаяБумага.Видимость  = ЭтаФорма.ОтборПоБумаге;
	Если Не ЭтаФорма.ОтборПоБумаге  Тогда
		Объект.ЦеннаяБумага = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЭтоРПИ = (Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ"));
	
	ЭтаФорма.Элементы.ГруппаКотировки.Видимость = Не ЭтоРПИ;
	ЭтаФорма.Элементы.ГруппаОтборПоЦБ.Видимость = Не ЭтоРПИ;
	
	Если ЭтоРПИ Тогда
		
		ЭтаФорма.ОтборПоБумаге = Не ЭтоРПИ;
		Объект.Котировки       = Не ЭтоРПИ;
		Объект.ЦеннаяБумага    = Неопределено;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьАктивыПриИзменении(Элемент)
	
	ЭтоРПИ = (Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ"));

	ЭтаФорма.Элементы.ГруппаНастройкиАссетс.Видимость = Объект.Активы;
	ЭтаФорма.Элементы.СформироватьОтчет.Видимость         = Не ЭтоРПИ;
	ЭтаФорма.Элементы.ВыгрузитьДатыПервыхПартий.Видимость = Не ЭтоРПИ;
	
	Если Не Объект.Активы Тогда
		Объект.СчетДоверительногоУправления = Неопределено;
	КонецЕсли;
	
	ЭтаФорма.ВыгрузитьДатыПервыхПартий = Ложь;
	ЭтаФорма.СформироватьОтчет         = Ложь;
	СформироватьОтчетПриИзменении(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.ГруппаОтчетРасхожденияЦен.Видимость = ЭтаФорма.СформироватьОтчет;
	
КонецПроцедуры

&НаСервере
Процедура СверитьДанныеНаСервере()
	
	ЭтаФорма.ОтчетСверкиДанных = "";
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ОбъектНаСервере.ДополнительныеСвойства.Вставить("ЗаполнитьДатыПервыхПартий", Истина);
	ЭтаФорма.ОтчетСверкиДанных = ОбъектНаСервере.СверитьДанныеВ_Assets1C8();
	
	ЭтаФорма.Элементы.ГруппаОтчетСверкиДанных.Видимость = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура СверитьДанные(Команда)
	
	Если Не Объект.Активы Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите таблицу данных для сверки.");
		Возврат;
	КонецЕсли;

	СверитьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "Сверка" Тогда
		Объект.Активы = Истина;
	ИначеЕсли ТекущаяСтраница.Имя = "Выгрузка" Тогда
		ВыгрузитьАктивыПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтчет(Команда)
	
	Если ЭтаФорма.ОтчетСверкиДанных = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для сохранения в файл. Сформируйте отчет",, "ОтчетСверкиДанных");
		Возврат;
	КонецЕсли;
	
	ТекДокумент = Новый ТекстовыйДокумент;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Укажите путь к файлу";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл HTML (*.html)| *.html";
	
	Если Диалог.Выбрать() Тогда
		
		ФайлДанных = Диалог.ПолноеИмяФайла;
		
		Попытка
			
			ТекДокумент.ДобавитьСтроку(ЭтаФорма.ОтчетСверкиДанных);
			ТекДокумент.Записать(ФайлДанных);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + ФайлДанных + " успешно сохранен.");
			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл не сохранен! " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
